



#include <iostream> // Импорт базовой библиотеки (нужна везде)
using namespace std; // Использование пространства имен std 

// Так можно делать однострочные коминтарии коминтарии
/* Так можно делать 
многострочные коминтарии коминтарии*/


int main(){ // int main - основная функция где можно писать код (обязательно main)
    // Тут можно писать код
    // ; - данная штука необходима для того чтобы команды работали и c++ понимал где конец а где начало (писать на конце строки с командой)
    std::cout; // Поиск cout в пространстве имен std
    

}